slackGPT/revalidation_denied/15 PnrRetrieveAndDisplay Request.xml

<soap-env:Envelope xmlns:soap-env="http://schemas.xmlsoap.org/soap/envelope/">
    <soap-env:Header>
        <ns0:MessageID xmlns:ns0="http://www.w3.org/2005/08/addressing">7dab782c-fd81-4f37-9a97-c67abdc35a0f
        </ns0:MessageID>
        <ns1:Action xmlns:ns1="http://www.w3.org/2005/08/addressing">http://webservices.amadeus.com/PADSRQ_10_2_1A
        </ns1:Action>
        <ns2:To xmlns:ns2="http://www.w3.org/2005/08/addressing">
            https://nodeD3.production.webservices.amadeus.com/1ASIWVPKVPK
        </ns2:To>
        <wsse:Session xmlns:wsse="http://xml.amadeus.com/2010/06/Session_v3" TransactionStatusCode="InSeries">
            <wsse:SessionId>0H4IECITVO</wsse:SessionId>
            <wsse:SequenceNumber>8</wsse:SequenceNumber>
            <wsse:SecurityToken>2TPYISLQY0A5W1OBWRK8ISPJG2</wsse:SecurityToken>
        </wsse:Session>
    </soap-env:Header>
    <soap-env:Body>
        <ns0:PNR_RetrieveAndDisplay xmlns:ns0="http://xml.amadeus.com/PADSRQ_10_2_1A">
            <ns0:reservationInfo>
                <ns0:reservation>
                    <ns0:controlNumber>LV4VB6</ns0:controlNumber>
                </ns0:reservation>
            </ns0:reservationInfo>
            <ns0:dynamicOutputOption>
                <ns0:statusDetails>
                    <ns0:action>ALL</ns0:action>
                </ns0:statusDetails>
            </ns0:dynamicOutputOption>
        </ns0:PNR_RetrieveAndDisplay>
    </soap-env:Body>
</soap-env:Envelope>
